# Taps
tap "homebrew/bundle"
tap "homebrew/services"
tap "probe-rs/probe-rs"

# Homebrew
brew "jq"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "atuin"
brew "starship"
brew "emacs"
brew "neovim"
brew "lua-language-server"
brew "ripgrep"
brew "node"
brew "swiftformat"
brew "ninja"
brew "python@3.13"

if OS.linux?
brew "duplicity"
end

if OS.mac?
brew "swiftformat"
brew "direnv"
brew "mas"
brew "tidy-html5"
brew "cmake"
brew "probe-rs-tools"

# Cask
cask "raycast"
cask "visual-studio-code"
cask "discord"
cask "slack"
cask "spotify"
cask "iina"
cask "ghostty"
cask "kicad"
cask "google-chrome"
cask "obsidian"
cask "cursor"
cask "chatgpt"

# Mac App Store
mas "iA Writer", id: 775737590
mas "Tailscale", id: 1475387142
mas "1Password 7", id: 1333542190
mas "SQLiteFlow", id: 1378587993
mas "Ivory", id: 6444602274
mas "Pixelmator Pro", id: 1289583905
mas "Shapr 3D CAD modeling", id: 1091675654
end
