# Taps
tap "homebrew/bundle"
tap "homebrew/services"

# Homebrew
brew "jq"
brew "tailscale"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "atuin"
brew "starship"
brew "emacs"
brew "gh"
brew "neovim"
brew "lua-language-server"

if OS.linux?
brew "duplicity"
end

if OS.mac?
brew "git"
brew "swiftformat"
brew "direnv"
brew "finestructure/tap/arena"
brew "mas"
brew "tidy-html5"
brew "cmake"
brew "iterm2"

# Cask
cask "ngrok"
cask "raycast"
cask "visual-studio-code"
cask "docker"
cask "discord"
cask "slack"
cask "spotify"
cask "iina"
cask "swiftformat-for-xcode"
cask "utm"

# Mac App Store
mas "iA Writer", id: 775737590
mas "Tailscale", id: 1475387142
mas "1Password 7", id: 1333542190
mas "SQLiteFlow", id: 1378587993
mas "Ivory", id: 6444602274
mas "Pixelmator Pro", id: 1289583905
end
